In [19]:
import pandas as pd

In [20]:
data = pd.read_csv("./data/spam.csv",encoding='latin1')

In [21]:
data_copy = data.copy()

In [22]:
data.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
2772,ham,Still in customer place,NaN,NaN,NaN
1109,ham,S s..first time..dhoni rocks...,NaN,NaN,NaN
1809,ham,"Aight, I'll ask a few of my roommates",NaN,NaN,NaN
70,ham,Wah lucky man... Then can save money... Hee...,NaN,NaN,NaN
3565,ham,Its ok..come to my home it vl nice to meet and...,NaN,NaN,NaN

In [23]:
data.shape

(5572, 5)

In [24]:
 data.isna().sum()

v1               0
v2               0
Unnamed: 2    5522
Unnamed: 3    5560
Unnamed: 4    5566
dtype: int64

In [25]:
data.duplicated().sum()

np.int64(403)

In [26]:
data.drop_duplicates(inplace=True)

In [27]:
data.duplicated().sum()

np.int64(0)

In [38]:
new_df = data[['v1','v2']]

In [39]:
new_df.head()

     v1                                                 v2
0   ham  Go until jurong point, crazy.. Available only ...
1   ham                      Ok lar... Joking wif u oni...
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...
3   ham  U dun say so early hor... U c already then say...
4   ham  Nah I don't think he goes to usf, he lives aro...